app/Controllers/Crud.php

SELECT *
FROM `products`
---
    public function index()
    {
        $data['products'] = $this->infoData->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = '3'
---
        public function edit($id = null)
    {
        $data['products'] = [$this->infoData->find($id)]; // Ubah ke array